# Ultralytics YOLOv8 + CBAM attention in neck
# CBAM is added after each C2f block in the PAN neck for better feature focus
# Usage: model = YOLO("yolov8-cbam.yaml")  or  model = YOLO("yolov8-cbam.yaml").load("yolov8m.pt")

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

# PAN neck + CBAM attention after each C2f
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11 — cat backbone P4
  - [-1, 3, C2f, [512]]                          # 12
  - [-1, 1, CBAM, [512]]                         # 13 — attention on fused P4 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 — cat backbone P3
  - [-1, 3, C2f, [256]]                          # 16
  - [-1, 1, CBAM, [256]]                         # 17 — P3/8 small (detect head input)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19 — cat from layer 13 (CBAM-P4)
  - [-1, 3, C2f, [512]]                          # 20
  - [-1, 1, CBAM, [512]]                         # 21 — P4/16 medium (detect head input)

  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 9], 1, Concat, [1]]                    # 23 — cat backbone P5 (SPPF)
  - [-1, 3, C2f, [1024]]                         # 24
  - [-1, 1, CBAM, [1024]]                        # 25 — P5/32 large (detect head input)

  - [[17, 21, 25], 1, Detect, [nc]]              # 26 — Detect(P3, P4, P5)
